Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: This value puts a limit on the values of n for $n in templates, and it determines the number of ranges in the returned NSText Checking Result instances returned in the match... methods.
ja: この値は、それはテンプレートにおける$nのnの値に制限を課します、それでそれは返されるNSText Checking Resultインスタンスの中のいくらかある範囲の数を決定します、それらインスタンスはmatch...メソッドにおいて返されます。

source: This value specifies a URL which is suitable for presentation to the user as a link for further information about this cookie.
ja: この値はURLを指定します、それはこのクッキーについてのさらに進んだ情報に対するリンクとしてユーザに提示するのに適します。

source: This will happen only if needed, that is, the first part is already not showing the exact byte count.
ja: これは必要とされる場合にのみ起こります、すなわち、最初の部分がまだ正確なバイト計数を表示していない場合。

source: This will hold the Energy Formatter .Unit value that corresponds to the returned units.
ja: これは返される単位に対応する、Energy Formatter .Unit値を保持します。

source: This will resize the data if required, to fit the entire contents of buffer.
ja: これは、必要とされるならばbufferの全内容に合うように、データをリサイズします。

source: This will resize the data if required, to fit the entire contents of data.
ja: これは、必要とされるならばdataの全内容に合うように、データをリサイズします。

source: This will resize the data if required, to fit the entire contents of new Elements.
ja: これは、必要とされるならばnew Elementsの全内容に合うように、データをリサイズします。

source: Thread Safety
ja: スレッド安全

source: Threading Considerations
ja: スレッドの考察

source: Thus, for a directory, this method is called once for the directory and once for each item in the directory.
ja: したがって、ディレクトリに対して、このメソッドはそのディレクトリに対して一度だけ、そしてディレクトリの中の項目それぞれに対して一度呼び出されます。

source: To access the service:
ja: サービスにアクセスするには：

source: To avoid blocking execution on the main thread, you should call this method in an Operation or Grand Central Dispatch block that executes asynchronously in the background.
ja: メインスレッドでの実行の遮断を防ぐために、あなたはこのメソッドをOperationまたはGrand Central Dispatchブロックにおいて呼び出すべきです、それはバックグラウンドで非同期に実行します。

source: To avoid the unexpected copy, use the index(after:) method starting with start Index to produce indices instead.
ja: 予期されないコピーを避けるために、代わりにindex(after:)メソッドを使ってstart Indexで始めることで、インデックスを生成してください。

source: To cause the posting of this notification, you must send either read In Background And Notify() or read In Background And Notify(for Modes:) to an appropriate NSFile Handle object.
ja: この通知を投函することを引き起こすには、あなたはread In Background And Notify()またはread In Background And Notify(for Modes:)のどちらかを適切なNSFile Handleオブジェクトに送らなければなりません。

source: To check whether a collection is empty, use its is Empty property instead of comparing count to zero.
ja: あるコレクションが空かどうか調べるには、それのis Emptyプロパティを使ってください、countをゼロと比較するのでなく。

source: To compute a sequence of results, use the enumerate Dates function, rather than looping and calling this method with the previous loop iteration’s result.
ja: 結果のシーケンスを計算するには、enumerate Dates関数を使ってください、以前のループ反復の結果を使ってこの関数をループして呼び出す代わりにです。

source: To create a copy of an object, use the copy With Zone: method instead.
ja: あるオブジェクトのコピーを作成するには、copy With Zone:メソッドを代わりに使ってください。

source: To create a new file wrapper and add it to a directory, use the add Regular File(with Contents: preferred Filename:) method.
ja: 新しいファイルラッパーを作成してそれをディレクトリに加えるには、add Regular File(with Contents: preferred Filename:)メソッドを使ってください。

source: To create a subclass of NSInput Stream you may have to implement initializers for the type of stream data supported and suitably re-implement existing initializers.
ja: NSInput Streamのサブクラスを作成するためにあなたは、サポートされるストリームデータのためのイニシャライザを実装、および既存のイニシャライザを適切に再実装しなければならないかもしれません。

source: To create an Host object, use the current(), init(address:), or init(name:) class methods (don’t use alloc and init).
ja: Hostオブジェクトを作成するには、current()、init(address:)、またはinit(name:)クラスメソッドを使ってください（allocとinitを使わないでください）。

source: To decode such a key with the correct capitalization, define a custom Coding Keys enumeration, as described in Encoding and Decoding Custom Types.
ja: そのようなキーを正しい大文字かでデコードするには、あつらえのCoding Keys列挙を定義してください、あつらえの型のエンコーディングとデコーディングで記述されるように。

source: To delete a file permanently from the user’s iCloud storage, use the regular File Manager routines for deleting files and directories.
ja: ファイルを永久にユーザのiCloudストレージから削除するには、通常のFile Managerルーチンをファイルとディレクトリの削除に対して使ってください。

source: To designate the principal class, control-drag the file containing its implementation to the top of the list.
ja: プリンシパルクラスを指名するには、それの実装を含んでいるファイルを「Control-ドラッグ」して、リストの一番上にしてください。

source: To determine a file’s upload status, check the NSURLUbiquitous Item Is Uploaded Key attribute of the corresponding NSURL object.
ja: ファイルのアップロード状態を特定するには、対応するNSURLオブジェクトのNSURLUbiquitous Item Is Uploaded Key属性を確認してください。

source: To determine if iCloud is available, especially at launch time, check the value of the ubiquity Identity Token property instead.
ja: iCloudが利用可能であるか決定するには、とりわけ起動時では、代わりにubiquity Identity Tokenプロパティの値を調べてください。

source: To do so, specify item Replacement Directory for the directory parameter, user Domain Mask for the domain parameter, and a URL for the url parameter which determines the volume of the returned URL.
ja: そうするには、item Replacement Directoryをdirectoryパラメータに、user Domain Maskをdomainパラメータに、そしてあるURLを、返されるURLのボリュームを決定するurlパラメータに指定してください。

source: To establish access to a ubiquity container, call the url(for Ubiquity Container Identifier:) method.
ja: ある偏在コンテナへのアクセスを確立するには、url(for Ubiquity Container Identifier:)メソッドを呼び出してください。

source: To get this information, you can call this method repeatedly, each time removing the identifiers returned by the previous call.
ja: この情報を得るために、あなたは、毎回前の呼び出しによって返される識別子を削除しながら、このメソッドを繰り返し呼び出すことができます。

source: To iterate over the elements of a collection with its indices, use the zip(_: _:) function.
ja: あるコレクションの要素すべてにわたってそれのインデックスで反復するには、zip(_: _:)関数を使ってください。

source: To learn how to view your development team’s unique <TEAM_ID> value, read To view the team ID in Tools Workflow Guide for Mac.
ja: あなたの開発チームの特有<TEAM_ID>値を眺める方法を学ぶために、To view the team ID を Tools Workflow Guide for Mac で見てください。

source: To locate an object that can respond to the message encoded in an Invocation.
ja: an Invocationにおいてエンコードされるメーセージに応答できるオブジェクトを突き止める。

source: To look up a particular entry, you specify the name of the original RTF help file in the key parameter of this method.
ja: 特定の登録項目を捜すには、あなたは元のRTFヘルプファイルの名前をこのメソッドのkeyパラメータにおいて指定します。

source: To make a selector, NSSelector From String(_:) passes a UTF-8 encoded character representation of a Selector Name to sel_register Name(_:) and returns the value returned by that function.
ja: セレクタを作るために、NSSelector From String(_:)はa Selector NameUTF-8エンコードされた文字表現をsel_register Name(_:)に渡します、そしてこの関数によって返される値を返します。

source: To make use of the default implementation, you must therefore implement and register a suitable class description—see NSClass Description.
ja: 省略時の実装を使えるようにするには、あなたは従ってふさわしいクラス記述を実装して登録する必要があります—NSClass Descriptionを見てください。

source: To obtain a reference to it, you call the class method shared(), which creates the instance if it doesn’t already exist.
ja: それに対する参照を入手するには、あなたはクラスメソッドshared()を呼び出します、それはそれがまだ存在しないならばそのインスタンスを作成します。

source: To obtain an appropriate hint, use sorted Array Hint.
ja: 適切なヒントを入手するには、sorted Array Hintを使います。

source: To re-sort you need internally to create a map table mapping a hash to the index.
ja: 再ソートするにはあなたは内部的にマップテーブルを作成してハッシュをインデックスとマッピングする必要があります。

source: To reconcile this, ISO 8601 defines a week-numbering year, consisting of either 52 or 53 full weeks (364 or 371 days), such that the first week of a year is designated to be the week containing the first Thursday of the year.
ja: これを調整するために、ISO 8601は週番号年を定義します、丸々52または53週（364または371日）のどちらかから成っていて、ある年の最初の週がその年の最初の木曜日を含んでいる週であるように指定されます。

source: To remove the last element of a collection that might be empty, use the pop Last() method instead.
ja: 空であるかもしれないあるコレクションの最後の要素を除去するには、pop Last()関数を使ってください。

source: To represent a quantity of time specified by an NSDate Components object, use Date Components Formatter instead.
ja: NSDate Componentsオブジェクトによって指定された時間量を表すには、代わりにDate Components Formatterを使ってください。

source: To represent an interval between two NSDate objects, use Date Interval Formatter instead.
ja: ２つのNSDateオブジェクトの間の隔たりを表すには、Date Interval Formatterを代わりに使ってください。

source: To represent dimensionless units, subclass Unit directly.
ja: 寸法なし単位を表すには、直接にUnitのサブクラスにしてください。

source: To respond to methods that your object does not itself recognize, you must override method Signature For Selector: in addition to forward Invocation:.
ja: あなたのオブジェクトがそれ自身では認識しないメソッドに応答するには、あなたはforward Invocation:に加えてmethod Signature For Selector:をオーバーライドする必要があります。

source: To send the message to that object using an Invocation.
ja: そのオブジェクトにan Invocationを使ってメッセージを送る。

source: To send these headers as part of a URL request to a remote server, create an NSMutable URLRequest object, then call the all HTTPHeader Fields or set Value(_: for HTTPHeader Field:) method to set the provided headers for the request.
ja: これらのヘッダーをあるURLリクエストの一部としてリモートサーバーに送るには、NSMutable URLRequestオブジェクトを作成してください、それからall HTTPHeader Fieldsまたはset Value(_: for HTTPHeader Field:)メソッドを呼び出して、提供されたヘッダをそのリクエストに対して設定してください。

source: To simplify your code, certain header field names are canonicalized into their standard form.
ja: あなたのコードを簡単にするために、特定のヘッダフィールド名はそれらの標準形式へと正規化されます。

source: To sort the elements of your collection in descending order, pass the greater-than operator (>) to the sort(by:) method.
ja: あなたのコレクションの要素を降順にソートするには、より大きい演算子（>）をsort(by:)メソッドに渡してください。

source: To sort the elements of your collection in descending order, pass the greater-than operator (>) to the sorted(by:) method.
ja: あなたのコレクションの要素を降順にソートするには、より大きい演算子（>）をsorted(by:)メソッドに渡してください。

source: To sort the elements of your sequence in descending order, pass the greater-than operator (>) to the sorted(by:) method.
ja: あなたのシーケンスの要素を降順にソートするには、より大きい演算子（>）をsorted(by:)メソッドに渡してください。

source: To sort your collection in descending order, pass the greater-than operator (>) as the are In Increasing Order parameter.
ja: あなたのコレクションを降順にソートするには、より大きい演算子（>）をare In Increasing Orderパラメータとして渡してください。

source: To sort your sequence in descending order, pass the greater-than operator (>) as the are In Increasing Order parameter.
ja: あなたのシーケンスを降順にソートするには、より大きい演算子（>）をare In Increasing Orderパラメータとして渡してください。

source: To specify a different rounding mode, use the NSDecimal Add(_: _: _: _:) function instead.
ja: 異なる丸めモードを指定するには、NSDecimal Add(_: _: _: _:)関数を代わりに使ってください。

source: To specify a different rounding mode, use the NSDecimal Divide(_: _: _: _:) function instead.
ja: 異なる丸めモードを指定するには、NSDecimal Divide(_: _: _: _:)関数を代わりに使ってください。

source: To specify a different rounding mode, use the NSDecimal Multiply(_: _: _: _:) function instead.
ja: 異なる丸めモードを指定するには、NSDecimal Multiply(_: _: _: _:)関数を代わりに使ってください。

source: To specify a different rounding mode, use the NSDecimal Power(_: _: _: _:) function instead.
ja: 異なる丸めモードを指定するには、NSDecimal Power(_: _: _: _:)関数を代わりに使ってください。

source: To specify a different rounding mode, use the NSDecimal Subtract(_: _: _: _:) function instead.
ja: 異なる丸めモードを指定するには、NSDecimal Subtract(_: _: _: _:)関数を代わりに使ってください。

source: To stop reading the file or socket, set the value of this property to nil.
ja: ファイルまたはソケットの読み込みを停止するには、このプロパティの値をnilに設定してください。

source: To stop writing data to the file or socket, set the value of this property to nil.
ja: ファイルまたはソケットへの書き出しを停止するには、このプロパティの値をnilに設定してください。

source: To store cookies from a set of response headers, an application can use cookies(with Response Header Fields: for:) passing a header field dictionary and then use this method to store the resulting cookies in accordance with the receiver’s cookie acceptance policy.
ja: 一揃いのレスポンスヘッダからクッキーを貯蔵するには、アプリケーションはcookies(with Response Header Fields: for:)をヘッダフィールド辞書を渡して使用して、それからこのメソッドを使って結果のクッキーをレシーバの持つクッキー受入方針に従って貯蔵できます。

source: To successfully create a cookie, you must provide values for (at least) the path, name, and value keys, and either the origin URL key or the domain key.
ja: うまくクッキーを作成するには、あなたは値を（少なくとも）path、name、そしてvalueキー、そしてorigin URLキーまたはdomainキーのどちらかに提供しなければなりません。

source: To support both encoding and decoding, declare conformance to Codable, which combines the Encodable and Decodable protocols.
ja: エンコードとデコードの両方をサポートするには、Codableへの準拠を宣言してください、それはEncodableとDecodableプロトコルを一体化します。

source: To undo the concatenation, you must invert the receiver’s matrix and invoke this method again.
ja: 連結を取り消しするには、あなたはレシーバの行列を逆にして、このメソッドをもう一度発動する必要があります。

source: To use the user's preferences, you can use [[NSUser Defaults standard User Defaults] dictionary Representation].
ja: ユーザの環境設定を使うには、あなたは[[NSUser Defaults standard User Defaults] dictionary Representation]を使用できます。

source: To use this class, create an instance, configure its properties, and call one of its methods to generate an appropriate string.
ja: このクラスを使うには、インスタンスを作成して、それのプロパティを設定して、そしてそれのメソッドの１つを呼び出すことで適切な文字列を生成してください。

source: To use this class, create an instance, configure its properties, and call the string(from: to:) method to generate a string.
ja: このクラスを使うには、１つのインスタンスを作成して、それのプロパティを構成設定します、そしてstring(from: to:)メソッドを呼び出すことで文字列を生成してください。

source: Topics
ja: 話題

source: Transforming Data
ja: データを変形する

source: Transforming Data and Objects
ja: データおよびオブジェクトの変換

source: Transforming Elements
ja: 要素を変形する

source: Transforming Index Paths
ja: インデックスパスを変更する

source: Transforming a Range
ja: 範囲を変形する

source: Translation factors do not affect NSSize values, which specify a differential between points.
ja: 変換因数は、NSSize値には影響を及ぼしません、それはポイント間の差異を指定します

source: Treat only \n as a line separator (otherwise, all standard line separators are used).
ja: \nだけを行セパレーターとみなします（一方そうしなければ、全ての標準的な行セパレーターが使われます）。

source: Treat the entire pattern as a literal string.
ja: 全てのパターンをリテラル（文字通りの）文字列とみなします。

source: Treat the following character as a literal, suppressing any special meaning.
ja: 続く文字を文字通りに、あらゆる特別な意味を抑制して扱います。

source: Tree-Based Processing
ja: ツリー基盤の処理

source: True if the parenthesized pattern does not match at the current input position.
ja: 括弧に入れられたパターンが現在の入力での位置でマッチしないならば真。

source: True if the parenthesized pattern does not match text preceding the current input position, with the last character of the match being the input character just before the current position.
ja: 括弧に入れられたパターンが現在の入力位置の前のテキストにマッチしないならば真、マッチの最後の文字がちょうど現在の位置の前の入力文字になる状態。

source: True if the parenthesized pattern matches at the current input position, but does not advance the input position.
ja: 括弧に入れられたパターンが現在の入力での位置でマッチするならば真、しかし入力での位置を進めません。

source: True if the parenthesized pattern matches text preceding the current input position, with the last character of the match being the input character just before the current position.
ja: 括弧に入れられたパターンが現在の入力位置の前のテキストにマッチするならば真、マッチの最後の文字がちょうど現在の位置の前の入力文字になる状態。

source: Truncates or extends the file represented by the receiver to a specified offset within the file and puts the file pointer at that position.
ja: レシーバによって表されるファイルを、ファイル内部の指定されたオフセットに切り詰めたり延長したりします、そしてファイルポインタをその位置に置きます。

source: Two arrays have equal contents if they each hold the same number of objects and objects at a given index in each array satisfy the is Equal(_:) test.
ja: ２つの配列は、それらがめいめい同じ数のオブジェクトを保持して、めいめいの配列の中のある与えられたインデックスでのオブジェクトがis Equal(_:)テストを満足させるならば、同等です。

source: Two elements are incomparable if neither is ordered before the other according to the predicate.
ja: ２つの要素は、述部によるとどちらもが他の前に並べられるならば比較できない。

source: Type Aliases
ja: 型エイリアス

source: Type Lookup
ja: 型検索

source: Type Method
ja: 型メソッド

source: Type Methods
ja: 型メソッド

source: Type Properties
ja: 型プロパティ

source: Type Property
ja: 型プロパティ

source: Type indicating a parameter is a pointer to an NSRect structure.
ja: あるパラメータがNSRect構造体へのポインタであるのを指し示している型。

source: Type indicating a parameter is array of NSRect structures.
ja: あるパラメータがNSRect構造体の配列であるのを指し示している型。

source: Type to specify the behavior of an association.
ja: ある連想の挙動を指定するための型。

source: Types such as the NSObject class and the NSObject Protocol protocol that provide the root functionality of most Objective-C classes
ja: NSObjectクラスとNSObject Protocolプロトコルのようないくつかの型で、大部分のObjective-Cクラスの根幹的機能性を提供するもの

source: Typically return values are 1 and greater.
ja: 一般的に戻り値は１以上です。

source: Typically, a message to a proxy is forwarded to the real object or causes the proxy to load (or transform itself into) the real object.
ja: 概して、プロキシへのメッセージは、実際のオブジェクトに転送されます、もしくはそのプロキシが実際のオブジェクトをロード（またはそれ自身がそれへと変形）することを引き起こします。

source: Typically, however, you are encouraged to relinquish resources prior to finalization if at all possible.
ja: 通常は、しかしながら、あなたはともかく可能ならばファイナライゼーションの前にリソースを放棄するのを奨励されます。

source: Typically, this means one of the following:
ja: 一般的に、これは以下のうちの１つを意味します：

source: Typically, you pass using New Metadata Only for this parameter, which uses only the metadata from the new item.
ja: 概して、あなたはusing New Metadata Onlyをこのパラメータに渡します、それは新しい項目からのメタデータのみ使います。

source: URL Loading System
ja: URLロードシステム

source: URL of the file the file wrapper is to reference.
ja: ファイルのURL、ファイルラッパーが参照することになります。

source: URL of the file-system node corresponding to the file wrapper.
ja: このファイルラッパーに相当するファイルシステムノードのURL。

source: URL of the file-system node the file wrapper is to represent.
ja: ファイルシステムノードのURL、ファイルラッパーが表すことになります。

source: URL of the file-system node to which the file wrapper’s contents are written.
ja: それへとファイルラッパーの持つ内容が書き出されるファイルシステムノードのURL。

source: URL of the file-system node with which to compare the file wrapper.
ja: ファイルシステムノードのURL、それとファイルラッパーを比較します。

source: Unarchives the contents of a nib file located in the receiver's bundle.
ja: レシーバの持つバンドルの中にロードされるnibファイルの内容をアンアーカイブします。

source: Understanding Bundle Structures
ja: バンドル構造を理解する

source: Union the Index Set with other.
ja: Index Setのotherとの和集合。

source: Unit of measure for acceleration
ja: 加速度の計測単位

source: Unit of measure for area
ja: 面積の計測単位

source: Unit of measure for concentration of mass
ja: 質量濃度の計測単位

source: Unit of measure for dispersion
ja: 分散に対する計測単位

source: Unit of measure for duration
ja: 期間の計測単位

source: Unit of measure for electric charge
ja: 電荷の計測単位

source: Unit of measure for electric current
ja: 電流の計測単位

source: Unit of measure for electric potential difference
ja: 電位差の計測単位

source: Unit of measure for electric resistance
ja: 電気抵抗の計測単位

source: Unit of measure for energy
ja: エネルギーの計測単位

source: Unit of measure for frequency
ja: 周波数の計測単位

source: Unit of measure for fuel consumption
ja: 燃費の計測単位

source: Unit of measure for illuminance
ja: 照度の計測単位

source: Unit of measure for length
ja: 長さの計測単位

source: Unit of measure for mass
ja: 質量の計測単位

source: Unit of measure for planar angle and rotation
ja: 平面の角度と回転のための計測単位

source: Unit of measure for power
ja: 電力の計測単位

source: Unit of measure for pressure
ja: 圧力の計測単位

source: Unit of measure for speed
ja: スピードの計測単位

source: Unit of measure for temperature
ja: 温度の計測単位

source: Unit of measure for volume
ja: 体積の計測単位

source: Units and Measurement
ja: 単位と寸法

source: Units continue to be dropped until a non-zero value is encountered.
ja: 単位は続けて落とされます、非ゼロの値が出会われるまで。

source: Units whose value is 0 are dropped starting at the end of the sequence.
ja: 値が０である単位は、一連のものの末尾から開始して落とされます。

source: Units whose values are 0 are dropped from anywhere in the middle of a sequence.
ja: 値が０である単位は、一連のものの真ん中のどこからも落とされます。

source: Units whose values are 0 are dropped starting at the beginning of the sequence.
ja: 値が０である単位は、一連のものの冒頭から開始して落とされます。

source: Unknown
ja: 不明

source: Unless the collection conforms to the Bidirectional Collection protocol, start must be less than or equal to end.
ja: コレクションがBidirectional Collectionプロトコルに準拠しない場合は、startはendより少ないか等しくなければなりません。

source: Unless the collection guarantees random-access performance, calculating count can be an O(n) operation.
ja: そのコレクションが無作為アクセス性能を保証しない限り、countの算出は、O(n)演算であるはずです。

source: Unlike NSMap Insert, this function raises NSInvalid Argument Exception if table already includes a key that matches key.
ja: NSMap Insertとは違い、この関数はNSInvalid Argument Exceptionを引き起こします、もしtableが既にkeyに合致するキーを含むならば。

source: Unlike NSHash Insert, this function raises NSInvalid Argument Exception if table already includes an element that matches pointer.
ja: NSHash Insertとは違い、この関数はNSInvalid Argument Exceptionを引き起こします、もしtableが既にpointerに合致する要素を含むならば。

source: Unlike in macOS, when all the apps in a given app group are removed from the device, the system detects this condition and removes the corresponding group directory as well.
ja: macOSとは違い、与えられたアプリグループの中のアプリ全てがデバイスから除去される場合、システムはこの状態を検知して、対応するグループディレクトリもまた削除します。

source: Unlike legacy methods, the objects adhere to the standard cocoa memory management rules; it is necessary to keep a strong reference to them by using IBOutlets or holding a reference to the array to prevent the nib contents from being deallocated.
ja: レガシーメソッドとは違い、オブジェクトそれらは、標準cocoaメモリ管理規則を固守します；必要なのは、それらに対する強い参照をIBOutletを使うことによって保つこと、またはnib内容デアロケートされるのを防ぐために配列への参照を保持することです。

source: Unlike some other Foundation classes with corresponding Core Foundation names (such as NSString and CFString), Bundle objects cannot be cast to CFBundle references.
ja: Core Foundation名に対応するいくつかの他のFoundationクラス（例えばNSStringとCFString）とは違い、BundleオブジェクトはCFBundle参照にキャストできません。

source: Unloads the code associated with the receiver.
ja: レシーバに関連付けられたコードをアンロードします。

source: Unsupported applications and demonstration versions.
ja: サポートされないアプリケーションおよびデモンストレーション版。

source: Updates all attachments based on files contained in the RTFD file package at path.
ja: pathでのRTFDファイルパッケージに含まれるファイルに基づいて全ての添付書類を更新します。

source: Updates the file wrapper to match a given file-system node.
ja: ファイルラッパーをある与えられたファイルシステムノードと合致するよう更新します。

source: Updating File Wrappers
ja: ファイルラッパーを更新する

source: Upon completion, you must similarly call the standard C macro va_end for this list.
ja: 完成したら、あなたは同様に標準C macro va_endをこのリストに対して呼び出さなければなりません。

source: Upon return, contains true if path is a directory or if the final path element is a symbolic link that points to a directory; otherwise, contains false.
ja: 戻りにおいて、trueを含みます、もしpathがディレクトリならば、または最後のパス要素がディレクトリを指すシンボリックリンクならば；そうでなければfalseを含みます。

source: Upon return, contains a pointer to a read buffer.
ja: 戻りでは、読み出しバッファに対するポインタを含みます。

source: Upon return, contains the number of bytes available.
ja: 戻りでは、利用可能なバイト数を含みます。

source: Upon return, the duration of the calendar component that contains the date.
ja: 返すにあたって、その日付を含むカレンダー構成要素の継続期間。

source: Upon return, the starting time of the calendar component that contains the date.
ja: 返すにあたって、その日付を含むカレンダー構成要素の始まりの時間。

source: Use add File Wrapper(_:) instead.
ja: add File Wrapper(_:)を代わりに使ってください。

source: Use attributes Of File System(for Path:) instead.
ja: attributes Of File System(for Path:)を代わりに使ってください。

source: Use attributes Of Item(at Path:) instead.
ja: attributes Of Item(at Path:)を代わりに使ってください。

source: Use contents Of Directory(at Path:) instead.
ja: contents Of Directory(at Path:)を代わりに使ってください。.

source: Use create Directory(at: with Intermediate Directories: attributes:) instead.
ja: create Directory(at: with Intermediate Directories: attributes:)を代わりに使ってください。

source: Use create Directory(at Path: with Intermediate Directories: attributes:) instead.
ja: create Directory(at Path: with Intermediate Directories: attributes:)を代わりに使ってください。

source: Use create Symbolic Link(at: with Destination URL:) instead.
ja: create Symbolic Link(at: with Destination URL:)を代わりに使ってください。

source: Use create Symbolic Link(at Path: with Destination Path:) instead.
ja: create Symbolic Link(at Path: with Destination Path:)を代わりに使ってください。

source: Use destination Of Symbolic Link(at Path:) instead.
ja: destination Of Symbolic Link(at Path:)を代わりに使ってください。

source: Use matches Contents(of:) instead.
ja: matches Contents(of:)を代わりに使ってください。

source: Use read(from: options:) instead.
ja: read(from: options:)を代わりに使ってください。
